app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%egg%')
SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" WHERE (name LIKE '%lost%') ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      if Rails.env == "development"
        @products = Product.where("name LIKE ?", "%#{search_term}%")
      else
        @products = Product.where("name ilike ?", "%#{search_term}%")
      end
    else
      @products = Product.all
    end
      @products =  @products.order("created_at DESC").paginate(:page => params[:page], per_page: 9)

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["product_id", 7], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 7]]
---
  def show
    @comments =  @product.comments.order("created_at DESC").paginate(:page => params[:page], per_page: 4)

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "color", "price") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "color" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["color", "blue"], ["updated_at", 2017-08-22 15:04:20 UTC], ["id", 38]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)